nerd_food/take_a_walk_on_the_server_side.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 15:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nerd Food: Take a Walk on the Server Side</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Nerd Food: Take a Walk on the Server Side</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
</tr>
</tbody>
</table>

<p>
Saturday, September 22, 2007
</p>

<p>
When it comes to programming, for me there isn't much of a choice: the
place to be is the server side. I may work a lot on the client side
these days, but GUIs and chrome never had much of an attraction for
me. I do have a healthy dose of respect for those who love it: client
side work is a mixture of coding mastery, design skills and a big
dollop of human psychology. For some reason when I visualise the
client side I always imagine nice, pristine offices with lots of light
and huge amounts of human interaction between programmers as well as
between programmers and users.
</p>

<p>
The server side is a totally different beast. I always visualise it as
the dark place of green terminals and server rooms, of never ending
performance charts and monitor applications, the land of blinken
lights. Of course, these days we all have to share the same desks and
deal with the same layers of managerial PHBs - and with HR and their
latest social experiments - but the fundamental point is that these
are two very different crafts.
</p>

<p>
Thing is, I find that the server side is extremely misunderstood
because the vast majority of developers out there come from a client
background. When developers cross over, their bias introduces many,
many problems on server side applications, simply because they are not
used to the server way of thinking.
</p>

<p>
This article covers many mistakes I've seen over the years, in the
hope you may avoid them, offering some tentative solutions.
</p>

<div id="outline-container-orgff57abc" class="outline-2">
<h2 id="orgff57abc">The Languages</h2>
<div class="outline-text-2" id="text-orgff57abc">
<p>
There really is only one language to do server side work: C++. Yes,
I'm a zealot. Yes, I know that both .Net and Java are much easier to
get along with, and have none of the tricky memory allocation problems
that riddle C++ applications (those that haven't discovered shared
pointers, at any rate). I agree that, in theory, both Java and C# are
better options. In practice, however, they become problematic.
</p>

<p>
The right staff. It's difficult to find a got Java/C# programmer, just
like it was difficult to find a good VB programmer. The client side is
a very forgiving land, and not only can bad programmers get away with
it for years but you also have to remember that great client side
programmers don't need to know their tools to the level of detail that
server side programmers do. How many times do you need to read up on
scheduling to do a GUI? Or on TCP flags? Not often, I'd wager. So the
reality is, if you have been doing any of these languages for a while,
you can talk all the right TLAs and describe all the right concepts
with easiness and fly through most interviews. But when it comes to
doing the job, you will probably be reading manuals for days trying to
figure out which subset of technologies on your stack are good for
server side and which ones are just plain evil performance killers. A
good server side Java/C# programmer will use only the smallest set of
features of the language when programming, knowing exactly the cost of
those features.
</p>

<p>
It is, of course, really hard to find a good C++ programmer too. But
here, there are two things that help us. There are not that many left
doing C++ work - most of them have migrated to higher pastures by now,
in particular those that always felt uncomfortable with the
language. The few that are left are doing server side work. The second
thing is, due to C++'s lower level of abstraction, even a bad C++
programmer is well aware of the bare metal. It basically forces you to
think harder, rather than just pickup a manual and copy an example.
</p>

<p>
Minimise layers of indirection. Another problem I have with Java/C# is
indirection, which is another way of saying performance. Now, I know
all you Java and .Net heads have many benchmarks proving how your AOT
compilers optimise on the fly and make them even faster than native
code, or how your VM is much better at understanding application's run
time behaviour and optimising itself for it. And the fact that you
never worry about memory leaks goes without saying. Well, that's all
fine and dandy as far as the lab is concerned.
</p>

<p>
What I found out on the field is different. Resource allocation is
still a massive problem, either due to complex cyclical referencing,
or just plain programmer incompetence. Memory consumption is massive,
because programmers don't really understand the costs involved in
using APIs, and thus just use whatever is easier. This, of course,
also impacts performance badly. And to make things even worse, you
then have to deal with the non-deterministic behaviour of the VM. It's
bad enough not knowing what the kernel will decide and when, but when
you put in a VM - and god forbid, an application server! - then its
nigh impossible. It could be a VM bug. Or it could be that you are not
using certain API properly. Or it's just your complex code. Or it's
the OS's fault. Who knows. That's when you have to fork out mega-bucks
and pay an expensive Java/.Net consultant to sort it all out. And pray
he/she knows what he/she is talking about.
</p>

<p>
The truth is, I've never heard of a Java/.Net application on the field
that was found to be more performant than it's C++ counterpart. In
part, this is because we are comparing apples with oranges - the
rewrites seldom cover the same functionality, adding large amounts of
new features and making straight comparisons impossible. But there
must be more to it too, since, from experience, Java/.Net engineers
seem to spend an inordinate amount of time trying to improve
performance.
</p>

<p>
Now, before you go and start rewriting your apps in C++, keep this in
mind: the biggest decision factor in deciding a language is the
competence of your staff. If you have a Java/.Net house, and you ain't
going to hire, don't use C++. It will only lead to tears and
frustration, and in the end you will conclude C++ is crap. If you are
really serious about C++, you will need a team of very strong,
experienced C++ developers leading the charge. If you haven't got
that, best use whatever language you are most competent at.
</p>

<p>
Another very important thing to keep in mind is the greatest C++
shortcoming: its small standard class library. It is perhaps the
language's biggest problem (and probably the biggest reason for
Java/c#'s success). This means you either end up writing things from
scratch, buying a third party product (vendor lock-in) or using one or
several open source products, each with their own conventions, styles,
etc. At present Boost is a must have in any C++ shop, but it does not
cover the entire problem domain of server side development. These are
the following things to look for in any library:
</p>

<ul class="org-ul">
<li>Networking</li>
<li>Database access</li>
<li>Threading</li>
<li>Logging</li>
<li>Configuration</li>
<li>Serialisation</li>
</ul>
</div>
</div>
