nerd_food/take_a_walk_on_the_server_side.html

<div id="outline-container-org0506375" class="outline-2">
<h2 id="org0506375">The Hardware Platform</h2>
<div class="outline-text-2" id="text-org0506375">
<p>
As far as the client side is concerned, platform is almost a
non-issue: you will most likely only support Windows on x86. After
all, Linux and Mac are so far behind in terms of market share it's not
even funny. The cautious developer will point out that a Web
application is a safer bet, although you may loose much richness due
to the limitations of the technology. AJAX is nice, but not quite the
same as a solid GUI. If kiosks and POS are some or all of your target
market, you will be forced to look at cross-platform since Linux is
making inroads in this market. And you can always use Java.
</p>

<p>
With regards to the server side, one must look at the world in a
totally different light. Because you never know what your scalability
requirements are, there is no such thing as an ideal hardware
platform. Today, one 32-bit Windows server with 2 processors and 4
gigs or RAM may be more than enough; tomorrow you may need to run apps
that require 20 gigs of RAM and 16 processors, and big iron is your
only option.
</p>

<p>
So the most important aspect in terms of the hardware platform is
this: whatever you do, <span class="underline">never</span> commit yourself to one. Write a
cross-platform application from the start, and ensure it remains
one. Even on a Windows only shop, it's not hard to use a
cross-platform toolkit and have a PowerPC Linux box on the side to run
tests on. Its actually not much harder to write cross-platform <span class="underline">server
side</span> code, as long as you have a library you can trust to abstract
things properly. And as long as you take cross-platform testing
seriously.
</p>

<p>
Think of it as an insurance policy. One day, when your boss asks you
for a 10-fold increase in deal volume, you know you can always run to
the shop and buy some really, really big boxen to do the job. Tying
yourself to an hardware platform is like putting all of your eggs in
one basket; better not drop it.
</p>
</div>
</div>

<div id="outline-container-orgc9f3ed7" class="outline-2">
<h2 id="orgc9f3ed7">The Architecture</h2>
<div class="outline-text-2" id="text-orgc9f3ed7">
<p>
The single most important lesson to learn on the server side is that
architecture is everything. No server side project should start
without first having a top notch architect, known to have built at
least two large scale systems. You can always do it on the cheap, save
the money and get more programmers instead, but remember: you will pay
the cost later. Things would be different if maintenance was taken
seriously; but don't kid yourself, it's not.
</p>

<p>
When the business suddenly tells you that you need to double up
capacity, or support Asia and America, or add some products that are
radically different from the ones your system now processes - that's
when you'll feel the pain. And that's when you'll have to start
designing v2.0 of your system, starting mainly from scratch.
</p>

<p>
One of the key differences between client side and server side work is
this focus on scalability. After all, there is only so much work a
single person can do, so many simultaneous instances of a client side
application that can be started on any one machine, and so many trades
that can be loaded into a single PC. Not so with the server side. You
may think that processing N trades is more than enough, but that is
today; tomorrow, who knows, 10xN could be the average.
</p>

<p>
A good architect will probably look at the problem and find ways to
distribute it. That is, to design a very large number of small,
well-defined servers, each of which with a small subset of
responsibilities - all talking to each other over a messaging bus of
some kind. The system will use a narrow point of access to the
database, and huge amounts of caching on each server. This will allow
the system to scale as demand grows, just by adding more
servers. Hardware is cheap; software engineers are expensive.
</p>

<p>
The ideal architect will also be clever enough to allow client tools
to be written on Java or C#, and let someone with more experience on
these matters lead its development.
</p>

<p>
In summary, the key components of a system will be along these lines:
A solid, cross-platform, scalable relational database. Oracle and
Sybase are likely candidates, and PostgreSQL on the free software side
of things; A solid, cross-platform, scalable messaging bus. Tibco,
Talarian, etc. Choose something you have experience with. Never, ever,
under any circumstances write your own. (at present, I'm not aware of
any free software alternatives for messaging); A large number of small
servers, communicating over the messaging bus.  Getting the
architecture right is essential; but once you're there, you must work
hard to maintain it.
</p>
</div>
</div>

<div id="outline-container-orge9e2ab1" class="outline-2">
<h2 id="orge9e2ab1">The Database</h2>
<div class="outline-text-2" id="text-orge9e2ab1">
<p>
Just as you need an architect, you also need a DBA. You may be a
hotshot when it comes to databases, you think, but the truth is a good
DBA will take your optimal code and optimise it ten times
over. Minimum. It's what they do for a living. It's important to get
the DBA early into the system design process to ensure no crass
mistakes are made on the early stages. These are much harder to fix
afterwards. And make sure the schema is designed by him/her, with
large input from developers - minimising the impedance mismatch
between the C++ datamodel and the database schema.
</p>

<p>
If your DBA hasn't got the bandwidth to write all the stored procs
directly, at least make sure he/she sets down the guide lines on how
to write the stored procs, and if at all possible reviews code before
check-ins.
</p>

<p>
You should also create a repeatable testing framework for performance
on all procs, to detect quickly when somebody makes a change that
impacts performance. But a good DBA will tell you all about it, and
many things more.
</p>
</div>
</div>
