nerd_food/take_a_walk_on_the_server_side.org
** A Catalogue of Mistakes

There are many small mistakes to be found on server side apps, some at
the architectural level, others at the implementation. This is a
summary of a few I've seen over the years.

*Overusing XML*. Whilst XML is a brilliant technology to enable
cross-platform communication, and it has many benefits for client side
development, it is of very limited usage on the server side. Pretty
much the only things it should be considered for are: Allow Java /
.Net clients to talk to the server side; Allow external parties to
send data into our system; Save the configuration settings for
servers.  It should not be used for anything else. (And even then, you
should still think really hard about each of these cases). It
certainly should not be used for communication between servers within
the server side, nor should it be used, god forbid, in any kind of way
within the database. De-serialising XML in a stored proc is an
aberration of server side nature.

Bear in mind the following XML constraints: The vast majority of the
message is redundant information, making messages unnecessarily
large. This will clog up your pipes, and have particularly nasty
effects in terms of throughput on high-latency links (any large
message will).  XML messages normally have associated a schema or
DTD. Servers that you yourself wrote will use the same serialisation
code, so there shouldn't be any need to validate these messages
against a DTD/schema (you will of course have some sanity checks on
C++).  Serialising and de-serialising from XML is horrendously
expensive. In particular, if all your servers are running on the same
hardware platform, there are absolutely no benefits - and the costs
are massive.  Compressed XML is a solution in need of a problem. You
may save costs on transport, but these have been transferred to an
intensive CPU bound process (decompressing and compressing).  In
conclusion, XML is not cheap. As your deal volumes increase, you will
find that you're spending more and more of your absolute time
transporting, serialising, de-serialising and validating. It's fine
for one-offs, for sure, but not for volume.

The only type of serialisation permitted on the server room is binary
serialisation. You can make it cross-platform using something along
the lines of XDR or X.409.

The lesson we learn from XML is applicable everywhere else on the
server side: always evaluate cautiously a technology and make sure you
fully understand its costs - in particular with regards to increases
in volume.

XML is a brilliant technology, and fit for purpose; that purpose is
not efficiency.

*Cool technologies*. If you didn't listen to my point on how C++ is
the only option and insisted in using Java or C# - or, god forbid, you
found a way of doing it in C++ - you may have started using
reflection. This, and many other technologies are utterly forbidden on
the server side.

Very much like XML, the problem with such technologies is that in 99%
of cases they are used to solve problems that never existed in the
first place. I mean, do you really need to dynamically determine the
database driver you are going to use? How often do you change
relational database providers without making any code changes? Of
course, those calls would be cached, but still, it's the principle
that matters. And does it really help application design to determine
at run-time which method to call, and its parameters and their types?
This is several orders of magnitude more expensive than virtual
functions. Does it really make coding any simpler? Because the cost is
huge, and the scalability is poor. If you are using reflection because
there is large amount of repetitive code, which can be factored out
with reflection, consider using a text processing language to generate
the repetitive code. This is a clean, maintainable and performant
solution.

Another pet peeve are components and distributed technologies. Do you
really need complex technologies such as (D)COM and CORBA? Components
are nice in theory, but in reality they add huge amounts of
maintenance problems, configuration costs, debugging becomes much
harder and performance is hindered in mysterious ways.

In the vast majority of cases, you can create your own little
messaging layer in extremely simple C++ - code that anyone understands
and can debug in seconds - built on top of a serialisation framework
such as Boost.Serialisation. Whilst Boost.Serialisation is not the
most performant of them all, nor does it have great support for
cross-platform binary serialisation, it is good enough for a large
number of cases; and you can extend its binary serialisation to fit
your needs.

The server side is not the place to experiment. Cool and hip are
bad. Pretty much all technologies that are required to make
large-scale, scalable applications have been invented decades ago -
they just need to be used properly. When choosing a server side
technology, always go down the proven path.

Performance testing. One thing many people do is to create servers
that can only be loaded up from a database or another server, and can
only send their results to a database or another server. This is a
crushing limitation, introduced for no reason other than laziness or
bad project planning ("test tools? no time for them!"). The whole
point of server side development is to be able to offer guarantees in
terms of scalability. Those guarantees can only be offered if there is
a reliable way of stress testing your components independently, and
create a baseline of such tests so that regressions can be found
quickly.

Having to setup an entire environment to test a given server is not
just troublesome, it hinders fault isolation. It may also mean that
there are only a few test systems available. Each developer should be
able to have their own development environment.

Of course, don't take me wrong: one should have system-wide
performance tests; but these are only relevant if all components
passed their individual load tests.

*GUI tools*. One thing you should consider from the beginning is the
ecosystem of GUI tools that are required to manage your system,
ideally written in a high-level language such as Java/C#. Here, in the
vast majority of cases, usability is more important than performance,
and this is where Java/C# are at their best.

The GUI tools should focus on things like: Account administration:
adding new users, deleting them, etc.  Monitoring and diagnostics:
graphs on deal volume, health checks to ensure servers are still
alive, memory usage, cpu usage.  Maintenance, deployment,
configuration: restarting servers when they die, easy deployment and
configuration of servers.  Data administration: special functions to
perform on the data to resolve cases where duff data was inserted,
etc. This is sort of a client for power users.  The biggest problem of
not having a good ecosystem of GUI management tools is that your
development work will became more and more operational, since the
system is too complex to give it to real operators.

*Database Serialisation*. This is one of the most important aspects of
any server side system, and has to be carefully thought out. You
should keep it to a bare minimum the number of servers that touch the
database directly, and make sure they are physically located as close
as possible to the database - but no closer; never on the same
machine. All other servers must go to these data servers to read and
write to the database.

The second important point is to try to "automate" the serialisation
as much as possible. All objects that are serialisable to the database
should have auto-generated code (never reflection!) responsible for
reading/writing the data. They should also interface with the database
via stored procs - never reading tables directly - all making sensible
use of transactions.

Keep it simple and Know Your Costs. Optimal code is normally very
simple; sub-optimal code is non-performant due to its complexity. This
simple truism underlies very much all performance work. It's very rare
that one needs to increase complexity to improve performance. In the
majority of cases, the easiest way is to ask the simple question: do
we really need to do this? And when you decide you really need to do
something, make sure you are fully aware of its O cost. Choosing a
O(N) approach (or worse) should never be taken lightly because it's a
scalability time bomb and it will always blow up when you need it the
least - i.e. when the system is overloaded.

I found that Object Orientation is in many cases detrimental to
performance, because people are so focused in API's and abstraction
that they forget about the hidden costs. For instance, it's common to
see a call-stack five levels deep (or more) just to do something as
simple as changing the value of a variable. Inheritance is
particularly evil due to its encapsulation breaking and
tight-coupling. When you think in terms of algorithms and data
structures, the costs are much more obvious.

In designing a modern OO system, it's best to: keep inheritance to an
absolute minimum, using either interfaces or client-supplier
relationships; keep behaviour to a minimum in the objects of your data
model - probably best if they are but glorified data structures with
getters/setters, on which other, more specialised classes operate on.

*Do not optimise early*. One classic case of early optimisation in C++
is not using virtual functions because of performance. This may be
true in certain cases, but you need to be coding really close to the
metal to start suffering from it. However, many programmers refuse to
consider inheritance or interfaces at design-time - even in systems
where microsecond performance will never be an issue - limiting their
options dramatically, for no real gain whatsoever. There are many,
many other such examples - like designing your own string class before
you proved it to be a bottleneck.

*Misuse of threads*. Another classic case in server side programming
is thread misuse. Many developers look at every bit of code and think:
"I'll stick a thread pool in there; this will scale really neatly when
we have more processors". The end result of this sort of thinking was
apparent at one customer site, where they had over 170 threads (!!!)
for one single server application. This application was running in
boxes with 64 processors, and sharing them with other instances as
well as other servers which also made liberal use of threads.

The problem with this approach is obvious: very rarely is there a need
to have more threads than processors (unless you're doing IO bound
work; and even then, threading may not be the best solution; consider
multiplexing); really thread-safe code requires lots of locking; when
you finally make your code multithread-safe you may find it performs
as badly as single threaded code - if not worse!  having ridiculous
amounts of threads hinders performance even if they are doing nothing
(as it was the case with our application above) because threads
consume resources and take time to construct and destroy.  Server side
and threading go hand-in-had, like bread and butter. But they should
only be used in cases where few or no locking is required - and that
requires large amounts of experience in application design.

