nerd_food/take_a_walk_on_the_server_side.org
** Conclusion

Designing large-scale, server side systems is a very difficult job and
should not be taken lightly. Lack of experience normally leads to
using the wrong technologies and making wrong fundamental
architectural decisions, which cannot be fixed at a later date. When
designing a large system from scratch, one should always prefer the
proven approaches to the new ideas the market keeps on churning.

| [[file:index.org][Back to essay index]] | [[file:../index.org][Back to home page]] |
